stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_cortex.c
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_cortex.c
  * @author  MCD Application Team
  * @brief   CORTEX HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CORTEX:
  *           + Initialization and Configuration functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================

    [..]
    *** How to configure Interrupts using CORTEX HAL driver ***
    ===========================================================
    [..]
    This section provides functions allowing to configure the NVIC interrupts (IRQ).
    The Cortex-M33 exceptions are managed by CMSIS functions.

    (#) Configure the NVIC Priority Grouping using HAL_NVIC_SetPriorityGrouping() function.
    (#) Configure the priority of the selected IRQ Channels using HAL_NVIC_SetPriority().
    (#) Enable the selected IRQ Channels using HAL_NVIC_EnableIRQ().

     -@- When the NVIC_PRIORITYGROUP_0 is selected, IRQ pre-emption is no more possible.
         The pending IRQ priority will be managed only by the sub priority.

     -@- IRQ priority order (sorted by highest to lowest priority):
        (+@) Lowest pre-emption priority
        (+@) Lowest sub priority
        (+@) Lowest hardware priority (IRQ number)

    [..]
    *** How to configure SysTick using CORTEX HAL driver ***
    ========================================================
    [..]
    Setup SysTick Timer for time base.

   (+) The HAL_SYSTICK_Config() function calls the SysTick_Config() function which
       is a CMSIS function that:
        (++) Configures the SysTick Reload register with value passed as function parameter.
        (++) Configures the SysTick IRQ priority to the lowest value (0x0F).
        (++) Resets the SysTick Counter register.
        (++) Configures the SysTick Counter clock source to be Core Clock Source (HCLK).
        (++) Enables the SysTick Interrupt.
        (++) Starts the SysTick Counter.

   (+) You can change the SysTick Clock source to be HCLK_Div8 by calling the macro
       __HAL_CORTEX_SYSTICKCLK_CONFIG(SYSTICK_CLKSOURCE_HCLK_DIV8) just after the
       HAL_SYSTICK_Config() function call. The __HAL_CORTEX_SYSTICKCLK_CONFIG() macro is defined
       inside the stm32u3xx_hal_cortex.h file.

   (+) You can change the SysTick IRQ priority by calling the
       HAL_NVIC_SetPriority(SysTick_IRQn,...) function just after the HAL_SYSTICK_Config() function
       call. The HAL_NVIC_SetPriority() call the NVIC_SetPriority() function which is a CMSIS function.

   (+) To adjust the SysTick time base, use the following formula:

       Reload Value = SysTick Counter Clock (Hz) x  Desired Time base (s)
       (++) Reload Value is the parameter to be passed for HAL_SYSTICK_Config() function
       (++) Reload Value should not exceed 0xFFFFFF

    [..]
    *** How to configure MPU using CORTEX HAL driver ***
    ========================================================
    [..]
    This section provides functions allowing to configure the MPU.
    The Cortex-M33 includes a memory protection unit (MPU) that can restrict the read and write accesses to
    memory regions (including regions mapped to peripherals).
    In Armv8-M architecture, memory types are divided into:
      (#) normal memory
      (#) device memory

    A normal memory has the following attributes:
    (#) cacheability: memories cacheable or non-cacheable
    (#) shareability: normal memory shareable or non-shareable
    (#) execute never: memories marked as executable or execute never (XN)

    A device memory has the following attributes:
    (#) G or nG: gathering or non-gathering. (multiple accesses to a device can be merged into a single
    transaction except for operations with memory ordering semantics, for example, memory barrier
    instructions, load acquire/store release).
    (#) R or nR: reordering
    (#) E or nE: early write acknowledge (similar to bufferable)

    Only four combinations of these attributes are valid:
    (#) device-nGnRnE: equivalent to Armv7-M strongly ordered memory type
    (#) device-nGnRE: equivalent to Armv7-M device memory
    (#) device-nGRE: new to Armv8-M
    (#) device-GRE: new to Armv8-M

    A normal memory has the following attributes:
    (#) Cache Allocation attribute : set when a cache line is allocated (no allocation, read/write/read-write allocation)
    (#) Cache write policy : write through (write to cache AND memory), write back (memory is written when the cache line is evicted)
    (#) Transient : indicates that the region will be used for a short period of time
    For normal memory, attributes can be set for inner and outer caches separately.
    Note that outer attributes set to 0 change the memory to device mode. Both inner and outer attributes should be set for normal memory.

    Sample configurations
    (#) Inner-outer cacheable, write back, read-write allocate INNER_OUTER(MPU_RW_ALLOCATE | MPU_WRITE_BACK)
    (#) Inner write back, read allocation, outer non-cacheable (MPU_R_ALLOCATE | MPU_WRITE_BACK) | OUTER(MPU_NOT_CACHEABLE)
    For detail on memory attributes, refer to the ARMv8-m MPU documentation.

    On STM32U3xx, the MPUs are split memory into regions (up to eight for the non-secure MPU,
    and up to twelve for the secure MPU).
    The secure MPU is only available when TrustZone is activated.

